package MidtermPractice;

import acm.program.ConsoleProgram;

//ამოცანა 1.ლოგარითმი (15 ქულა)
//თქვენი ამოცანაა დაწეროთ მეთოდი რომელიცლოგარითმს გამოითვლის.
//შეგახსენებთ რომლოგარითმი n-ის ფუძით m არის რიცხვი რომელხარისხშიც
//უნდა ავიყვანოთ n იმისათვის რომ m მივიღოთ. ანუ, თუ n^x =m , მაშინ xის მთელი
//ნაწილია შედეგი.
//n ^ x > m
//log(5 ,25) =2
//5, 26
//დაწერეთ მეთოდი log რომელსაც გადაეცემა 2 მთელი რიცხვი და რომელიც
//აბრუნებს ამ რიცხვებითვისლოგარითმის მთელნაწილს.
//თქვენ არ გავთ უფლება გამოიყენოთ Math კლასი. შესაბამისად ვერ გამოიყენებთ
//მეთოდებს log, log10, log1p, pow და ა.შ.
//ჩათვალეთ, რომ m>n>0.
//ამოხსნა დაწერეთ log.java ფაილში

public class Y2021_s1_p1 extends ConsoleProgram {
	public void run() {

		println(log(2, 8));
		println(log(5,25));
	}

	private int log(int n, int m) {
		int i = n;
		int x = 0;
		while (n <= m) {
			n *= i;
			x++;
		}
		return x;
	}

}
